namespace HW1.Models.Implementations;

public class Helmet : IEntity
{
    public int Id { get; set; }
    public string Name { get; set; } = string.Empty;

    public int Simplicity { get; set; }
    //даже шлему нужна простота, так как по сути в данной задаче простота - мера
    //доступности новичкам. Никто же не даст новичку очень дорогой шлем, плюсы которого может
    //почувствовать только профессионал, никто же не даст новичку шлем, который защищает не настолько
    //сильно, насколько это нужно новичку.

    //тут могут быть прочие свойства или функции, релевантные только для шлема
}